pmo-dataset/graphviz/43.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "Bring Documents for\nRegistration";
  "Bring Documents for\nRegistration" -> "Check if car is\nstill registered?";
  "Check if car is\nstill registered?" -> "Registered?";
  "Registered?" -> "Bring Documents for\nRegistration" [label="no"];
  "Send reminder\nnotification to user" -> "Received a\nnotificiation";
  "Gone to service?" -> "Mechanic check a car\nand enter problems" [label="yes"];
  "> 30 days?" -> "User fined" [label="yes"];
  "Mechanic check a car\nand enter problems" -> "Receive updates\nwhile waiting";
  "Receive updates\nwhile waiting" -> "Repair done?";
  "Repair done?" -> "Pay per App" [label="yes"];
  "Pay per App" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Save repair infos";
  "ParallelGateway_1" -> "Send 'Pickerl'";
  "Save repair infos" -> "ParallelGateway_2";
  "Send 'Pickerl'" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Make appointment for\nnext service";
  "Gone to service?" -> "> 30 days?" [label="no"];
  "Repair done?" -> "Receive updates\nwhile waiting" [label="no"];
  "Make appointment for\nnext service" -> "EndNoneEvent";
  "Received a\nnotificiation" -> "Gone to service?";
  "Check appointment\nfor service" -> "Send reminder\nnotification to user";
  "Registered?" -> "Check appointment\nfor service" [label="yes"];
  "User fined" -> "Make new appointment";
  "Make new appointment" -> "Check appointment\nfor service";
  "> 30 days?" -> "Send reminder\nnotification to user" [label="no"];

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "Registered?" [shape=diamond];
  "Gone to service?" [shape=diamond];
  "> 30 days?" [shape=diamond];
  "Repair done?" [shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
